Tekla Open API Reference for Tekla Structures 2025
CastUnitDrawing.CastUnitDrawingCreationType Enumeration
 Defines the Cast Unit Drawing Creation type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum CastUnitDrawingCreationType
Public Enumeration CastUnitDrawingCreationType
Members
Member name | Value | Description
CastUnitDrawingByPosition | 0 |  Creating the Cast Unit drawing by Position means we follow the position of the cast unit.
CastUnitDrawingById | 1 |  Creating the Cast Unit drawing by Id means we follow the id of the cast unit.
See Also
Reference
Tekla.Structures.Drawing Namespace